lequochaidevh/linux_stmProject/STM32F4/basic/Bai_pwm_dma/sources/platform/stm32f4/io_cfg.h
/******************************************************************************
* config Encoder - PID function
*******************************************************************************/
extern void Move_Up_Release(int16_t DCx, TM_PWM_TIM_t* TIM_Data, TM_PWM_Channel_t Channel, float percent);
extern void Move_Down_Release(int16_t DCx, TM_PWM_TIM_t* TIM_Data, TM_PWM_Channel_t Channel, float percent);
extern void Turn_Release(int16_t DCx, TM_PWM_TIM_t* TIM_Data, TM_PWM_Channel_t Channel, float percent);
extern void ALL_PWM_INIT(void);
extern void ALL_GPIO_INIT(void);
extern void timer4_config(void);
extern void Encoder1_Tim3_Init(void);
extern void Encoder2_Tim2_Init(void);
extern void Encoder3_Tim5_Init(void);
extern void ALL_ENCODER_INIT(void);
extern void ENCODER_Read_Release(float* Save_vitri_feedback, uint32_t* Dir, uint32_t* Cnt, TIM_TypeDef* TIMx);
extern void GPIO_PinMode(GPIO_TypeDef *GPIOx, uint32_t CLOCK, uint16_t GPIO_Pin, GPIOMode_TypeDef GPIO_Mode, GPIOOType_TypeDef GPIO_OType, GPIOSpeed_TypeDef GPIO_Speed, GPIOPuPd_TypeDef GPIO_PuPd);
/******************************************************************************
* adc function
* + themistor sensor
*
* Note: MUST be enable internal clock for adc module.
*******************************************************************************/
/* configure adc peripheral */
extern void io_cfg_adc1(void);

/* adc configure for CT sensor */
extern void adc_ct_io_cfg();
extern uint16_t adc_ct_io_read(uint8_t);

/* adc configure for thermistor sensor */
extern void adc_thermistor_io_cfg();
extern uint16_t adc_thermistor_io_read(uint8_t);

/******************************************************************************
* ssd1306 oled IO function
*******************************************************************************/
extern void ssd1306_clk_input_mode();
extern void ssd1306_clk_output_mode();
extern void ssd1306_clk_digital_write_low();
extern void ssd1306_clk_digital_write_high();

extern void ssd1306_data_input_mode();
extern void ssd1306_data_output_mode();
extern void ssd1306_data_digital_write_low();
extern void ssd1306_data_digital_write_high();
extern int  ssd1306_data_digital_read();

/******************************************************************************
* eeprom function
*******************************************************************************/
#define EEPROM_BASE_ADDRESS         (0x08080000)
#define EEPROM_MAX_SIZE             (0x1000)

extern uint8_t  io_eeprom_read(uint32_t, uint8_t*, uint32_t);
extern uint8_t  io_eeprom_write(uint32_t, uint8_t*, uint32_t);
extern uint8_t  io_eeprom_erase(uint32_t, uint32_t);

/******************************************************************************
* internal flash function
*******************************************************************************/
extern void internal_flash_unlock();
extern void internal_flash_lock();
extern void internal_flash_erase_pages_cal(uint32_t address, uint32_t len);
extern uint8_t internal_flash_write_cal(uint32_t address, uint8_t* data, uint32_t len);
extern void uart(int bau);
extern void windboneFlash_spi_ctrl_init();
extern int16_t MPU6050data[7];
extern int16_t temp, accel_x, accel_y, accel_z, gyro_x, gyro_y, gyro_z; // Raw values varaibles
extern float accel_x_OC, accel_y_OC, accel_z_OC, gyro_x_OC,gyro_y_OC, gyro_z_OC; // offset variables
extern float temp_scalled,accel_x_scalled,accel_y_scalled,accel_z_scalled,gyro_x_scalled,gyro_y_scalled,gyro_z_scalled; //Scalled Data varaibles
extern float accel_scale_fact, gyro_scale_fact; // Scale factor variables


extern void io_uart_interface_cfg();
extern void io_uart_interface_transfer(uint8_t);
extern uint8_t io_uart_interface_receiver();

extern void led_test_init();
extern void led_test_on();
extern void led_test_off();
#ifdef __cplusplus
}
#endif

#endif //__IO_CFG_H__
